show_main_menu_txt = """Привутствуем в меню, выберите действие:
        1 - просмотр категорий;
        2 - сброс и инициализация БД;
        9 - выход;"""
show_cath_1txt = """Просмотр списка категорий!
№\tНазвание\n-------------------------------------------------------------------------------------"""

show_cath_2txt = """-------------------------------------------------------------------------------------\nДальнейшие операции: 
    0 - возврат в главное меню;
    3 - добавление новой категории;
    4 - удаление категории;
    5 - просмотр блюд в категории;
    8 - обновить название категории;
    9 - выход."""
    
show_dish_in_cath_txt = """-------------------------------------------------------------------------------------\nДальнейшие операции:
    0 - возврат в главное меню;
    1 - возврат в просмотр категорий;
    6 - добавление нового блюда;
    7 - удаление блюда;
    8 - обновить блюдо в выбранной категории;
    9 - выход."""